/* automatically generated by rust-bindgen 0.69.2 */

pub const DPI_MAJOR_VERSION: u32 = 5;
pub const DPI_MINOR_VERSION: u32 = 2;
pub const DPI_PATCH_LEVEL: u32 = 0;
pub const DPI_DEFAULT_FETCH_ARRAY_SIZE: u32 = 100;
pub const DPI_DEFAULT_PREFETCH_ROWS: u32 = 2;
pub const DPI_DEFAULT_PING_INTERVAL: u32 = 60;
pub const DPI_DEFAULT_PING_TIMEOUT: u32 = 5000;
pub const DPI_DEFAULT_STMT_CACHE_SIZE: u32 = 20;
pub const DPI_DEQ_WAIT_NO_WAIT: u32 = 0;
pub const DPI_MAX_INT64_PRECISION: u32 = 18;
pub const DPI_SUCCESS: u32 = 0;
pub const DPI_FAILURE: i32 = -1;
pub const DPI_DEBUG_LEVEL_UNREPORTED_ERRORS: u32 = 1;
pub const DPI_DEBUG_LEVEL_REFS: u32 = 2;
pub const DPI_DEBUG_LEVEL_FNS: u32 = 4;
pub const DPI_DEBUG_LEVEL_ERRORS: u32 = 8;
pub const DPI_DEBUG_LEVEL_SQL: u32 = 16;
pub const DPI_DEBUG_LEVEL_MEM: u32 = 32;
pub const DPI_DEBUG_LEVEL_LOAD_LIB: u32 = 64;
pub const DPI_MODE_AUTH_DEFAULT: u32 = 0;
pub const DPI_MODE_AUTH_SYSDBA: u32 = 2;
pub const DPI_MODE_AUTH_SYSOPER: u32 = 4;
pub const DPI_MODE_AUTH_PRELIM: u32 = 8;
pub const DPI_MODE_AUTH_SYSASM: u32 = 32768;
pub const DPI_MODE_AUTH_SYSBKP: u32 = 131072;
pub const DPI_MODE_AUTH_SYSDGD: u32 = 262144;
pub const DPI_MODE_AUTH_SYSKMT: u32 = 524288;
pub const DPI_MODE_AUTH_SYSRAC: u32 = 1048576;
pub const DPI_MODE_CONN_CLOSE_DEFAULT: u32 = 0;
pub const DPI_MODE_CONN_CLOSE_DROP: u32 = 1;
pub const DPI_MODE_CONN_CLOSE_RETAG: u32 = 2;
pub const DPI_MODE_CREATE_DEFAULT: u32 = 0;
pub const DPI_MODE_CREATE_THREADED: u32 = 1;

pub type dpiStatementType = u16;
pub type dpiSubscrGroupingClass = u8;
pub type dpiSubscrGroupingType = u8;
pub type dpiSubscrNamespace = u32;
pub type dpiSubscrProtocol = u32;
pub type dpiSubscrQOS = u32;
pub type dpiTpcBeginFlags = u32;
pub type dpiTpcEndFlags = u32;
pub type dpiVectorFlags = u8;
pub type dpiVectorFormat = u8;
pub type dpiVisibility = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiConn {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiDeqOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiEnqOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiJson {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiLob {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiMsgProps {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiObject {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiObjectAttr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiObjectType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiPool {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiQueue {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiRowid {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSodaColl {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSodaCollCursor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSodaDb {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSodaDoc {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSodaDocCursor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiStmt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSubscr {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiVar {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiVector {
    _unused: [u8; 0],
}
pub type dpiSodaCollNames = dpiStringList;
pub type dpiAccessTokenCallback = ::std::option::Option<
    unsafe extern "C" fn(
        context: *mut ::std::os::raw::c_void,
        accessToken: *mut dpiAccessToken,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiBytes {
    pub ptr: *mut ::std::os::raw::c_char,
    pub length: u32,
    pub encoding: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_dpiBytes() {
    const UNINIT: ::std::mem::MaybeUninit<dpiBytes> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiBytes>(),
        24usize,
        concat!("Size of: ", stringify!(dpiBytes))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiBytes>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiBytes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiBytes),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiBytes),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoding) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiBytes),
            "::",
            stringify!(encoding)
        )
    );
}
impl Default for dpiBytes {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dpiIntervalDS {
    pub days: i32,
    pub hours: i32,
    pub minutes: i32,
    pub seconds: i32,
    pub fseconds: i32,
}
#[test]
fn bindgen_test_layout_dpiIntervalDS() {
    const UNINIT: ::std::mem::MaybeUninit<dpiIntervalDS> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiIntervalDS>(),
        20usize,
        concat!("Size of: ", stringify!(dpiIntervalDS))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiIntervalDS>(),
        4usize,
        concat!("Alignment of ", stringify!(dpiIntervalDS))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).days) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiIntervalDS),
            "::",
            stringify!(days)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hours) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiIntervalDS),
            "::",
            stringify!(hours)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minutes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiIntervalDS),
            "::",
            stringify!(minutes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seconds) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiIntervalDS),
            "::",
            stringify!(seconds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fseconds) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiIntervalDS),
            "::",
            stringify!(fseconds)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dpiIntervalYM {
    pub years: i32,
    pub months: i32,
}
#[test]
fn bindgen_test_layout_dpiIntervalYM() {
    const UNINIT: ::std::mem::MaybeUninit<dpiIntervalYM> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiIntervalYM>(),
        8usize,
        concat!("Size of: ", stringify!(dpiIntervalYM))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiIntervalYM>(),
        4usize,
        concat!("Alignment of ", stringify!(dpiIntervalYM))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).years) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiIntervalYM),
            "::",
            stringify!(years)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).months) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiIntervalYM),
            "::",
            stringify!(months)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiJsonNode {
    pub oracleTypeNum: dpiOracleTypeNum,
    pub nativeTypeNum: dpiNativeTypeNum,
    pub value: *mut dpiDataBuffer,
}
#[test]
fn bindgen_test_layout_dpiJsonNode() {
    const UNINIT: ::std::mem::MaybeUninit<dpiJsonNode> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiJsonNode>(),
        16usize,
        concat!("Size of: ", stringify!(dpiJsonNode))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiJsonNode>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiJsonNode))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oracleTypeNum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonNode),
            "::",
            stringify!(oracleTypeNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nativeTypeNum) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonNode),
            "::",
            stringify!(nativeTypeNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonNode),
            "::",
            stringify!(value)
        )
    );
}
impl Default for dpiJsonNode {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiJsonObject {
    pub numFields: u32,
    pub fieldNames: *mut *mut ::std::os::raw::c_char,
    pub fieldNameLengths: *mut u32,
    pub fields: *mut dpiJsonNode,
    pub fieldValues: *mut dpiDataBuffer,
}
#[test]
fn bindgen_test_layout_dpiJsonObject() {
    const UNINIT: ::std::mem::MaybeUninit<dpiJsonObject> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiJsonObject>(),
        40usize,
        concat!("Size of: ", stringify!(dpiJsonObject))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiJsonObject>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiJsonObject))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numFields) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonObject),
            "::",
            stringify!(numFields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldNames) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonObject),
            "::",
            stringify!(fieldNames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldNameLengths) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonObject),
            "::",
            stringify!(fieldNameLengths)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fields) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonObject),
            "::",
            stringify!(fields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldValues) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonObject),
            "::",
            stringify!(fieldValues)
        )
    );
}
impl Default for dpiJsonObject {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiJsonArray {
    pub numElements: u32,
    pub elements: *mut dpiJsonNode,
    pub elementValues: *mut dpiDataBuffer,
}
#[test]
fn bindgen_test_layout_dpiJsonArray() {
    const UNINIT: ::std::mem::MaybeUninit<dpiJsonArray> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiJsonArray>(),
        24usize,
        concat!("Size of: ", stringify!(dpiJsonArray))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiJsonArray>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiJsonArray))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numElements) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonArray),
            "::",
            stringify!(numElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elements) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonArray),
            "::",
            stringify!(elements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elementValues) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiJsonArray),
            "::",
            stringify!(elementValues)
        )
    );
}
impl Default for dpiJsonArray {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dpiTimestamp {
    pub year: i16,
    pub month: u8,
    pub day: u8,
    pub hour: u8,
    pub minute: u8,
    pub second: u8,
    pub fsecond: u32,
    pub tzHourOffset: i8,
    pub tzMinuteOffset: i8,
}
#[test]
fn bindgen_test_layout_dpiTimestamp() {
    const UNINIT: ::std::mem::MaybeUninit<dpiTimestamp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiTimestamp>(),
        16usize,
        concat!("Size of: ", stringify!(dpiTimestamp))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiTimestamp>(),
        4usize,
        concat!("Alignment of ", stringify!(dpiTimestamp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).year) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiTimestamp),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).month) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiTimestamp),
            "::",
            stringify!(month)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).day) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiTimestamp),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hour) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiTimestamp),
            "::",
            stringify!(hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minute) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiTimestamp),
            "::",
            stringify!(minute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).second) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiTimestamp),
            "::",
            stringify!(second)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fsecond) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiTimestamp),
            "::",
            stringify!(fsecond)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tzHourOffset) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiTimestamp),
            "::",
            stringify!(tzHourOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tzMinuteOffset) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiTimestamp),
            "::",
            stringify!(tzMinuteOffset)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dpiDataBuffer {
    pub asBoolean: ::std::os::raw::c_int,
    pub asUint8: u8,
    pub asUint16: u16,
    pub asUint32: u32,
    pub asInt64: i64,
    pub asUint64: u64,
    pub asFloat: f32,
    pub asDouble: f64,
    pub asString: *mut ::std::os::raw::c_char,
    pub asRaw: *mut ::std::os::raw::c_void,
    pub asBytes: dpiBytes,
    pub asTimestamp: dpiTimestamp,
    pub asIntervalDS: dpiIntervalDS,
    pub asIntervalYM: dpiIntervalYM,
    pub asJson: *mut dpiJson,
    pub asJsonObject: dpiJsonObject,
    pub asJsonArray: dpiJsonArray,
    pub asLOB: *mut dpiLob,
    pub asObject: *mut dpiObject,
    pub asStmt: *mut dpiStmt,
    pub asRowid: *mut dpiRowid,
    pub asVector: *mut dpiVector,
}
#[test]
fn bindgen_test_layout_dpiDataBuffer() {
    const UNINIT: ::std::mem::MaybeUninit<dpiDataBuffer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiDataBuffer>(),
        40usize,
        concat!("Size of: ", stringify!(dpiDataBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiDataBuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiDataBuffer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asBoolean) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asBoolean)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asUint8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asUint8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asUint16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asUint16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asUint32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asUint32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asInt64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asInt64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asUint64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asUint64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asFloat) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asFloat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asDouble) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asDouble)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asString) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asString)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asRaw) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asRaw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asBytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asTimestamp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asTimestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asIntervalDS) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asIntervalDS)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asIntervalYM) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asIntervalYM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asJson) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asJson)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asJsonObject) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asJsonObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asJsonArray) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asJsonArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asLOB) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asLOB)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asObject) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asStmt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asStmt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asRowid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asRowid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asVector) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataBuffer),
            "::",
            stringify!(asVector)
        )
    );
}
impl Default for dpiDataBuffer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiAnnotation {
    pub key: *const ::std::os::raw::c_char,
    pub keyLength: u32,
    pub value: *const ::std::os::raw::c_char,
    pub valueLength: u32,
}
#[test]
fn bindgen_test_layout_dpiAnnotation() {
    const UNINIT: ::std::mem::MaybeUninit<dpiAnnotation> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiAnnotation>(),
        32usize,
        concat!("Size of: ", stringify!(dpiAnnotation))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiAnnotation>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiAnnotation))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAnnotation),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keyLength) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAnnotation),
            "::",
            stringify!(keyLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAnnotation),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).valueLength) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAnnotation),
            "::",
            stringify!(valueLength)
        )
    );
}
impl Default for dpiAnnotation {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiAppContext {
    pub namespaceName: *const ::std::os::raw::c_char,
    pub namespaceNameLength: u32,
    pub name: *const ::std::os::raw::c_char,
    pub nameLength: u32,
    pub value: *const ::std::os::raw::c_char,
    pub valueLength: u32,
}
#[test]
fn bindgen_test_layout_dpiAppContext() {
    const UNINIT: ::std::mem::MaybeUninit<dpiAppContext> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiAppContext>(),
        48usize,
        concat!("Size of: ", stringify!(dpiAppContext))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiAppContext>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiAppContext))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).namespaceName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAppContext),
            "::",
            stringify!(namespaceName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).namespaceNameLength) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAppContext),
            "::",
            stringify!(namespaceNameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAppContext),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameLength) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAppContext),
            "::",
            stringify!(nameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAppContext),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).valueLength) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAppContext),
            "::",
            stringify!(valueLength)
        )
    );
}
impl Default for dpiAppContext {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiCommonCreateParams {
    pub createMode: dpiCreateMode,
    pub encoding: *const ::std::os::raw::c_char,
    pub nencoding: *const ::std::os::raw::c_char,
    pub edition: *const ::std::os::raw::c_char,
    pub editionLength: u32,
    pub driverName: *const ::std::os::raw::c_char,
    pub driverNameLength: u32,
    pub sodaMetadataCache: ::std::os::raw::c_int,
    pub stmtCacheSize: u32,
    pub accessToken: *mut dpiAccessToken,
}
#[test]
fn bindgen_test_layout_dpiCommonCreateParams() {
    const UNINIT: ::std::mem::MaybeUninit<dpiCommonCreateParams> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiCommonCreateParams>(),
        72usize,
        concat!("Size of: ", stringify!(dpiCommonCreateParams))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiCommonCreateParams>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiCommonCreateParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).createMode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiCommonCreateParams),
            "::",
            stringify!(createMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiCommonCreateParams),
            "::",
            stringify!(encoding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nencoding) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiCommonCreateParams),
            "::",
            stringify!(nencoding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).edition) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiCommonCreateParams),
            "::",
            stringify!(edition)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).editionLength) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiCommonCreateParams),
            "::",
            stringify!(editionLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).driverName) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiCommonCreateParams),
            "::",
            stringify!(driverName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).driverNameLength) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiCommonCreateParams),
            "::",
            stringify!(driverNameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sodaMetadataCache) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiCommonCreateParams),
            "::",
            stringify!(sodaMetadataCache)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stmtCacheSize) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiCommonCreateParams),
            "::",
            stringify!(stmtCacheSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessToken) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiCommonCreateParams),
            "::",
            stringify!(accessToken)
        )
    );
}
impl Default for dpiCommonCreateParams {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiConnCreateParams {
    pub authMode: dpiAuthMode,
    pub connectionClass: *const ::std::os::raw::c_char,
    pub connectionClassLength: u32,
    pub purity: dpiPurity,
    pub newPassword: *const ::std::os::raw::c_char,
    pub newPasswordLength: u32,
    pub appContext: *mut dpiAppContext,
    pub numAppContext: u32,
    pub externalAuth: ::std::os::raw::c_int,
    pub externalHandle: *mut ::std::os::raw::c_void,
    pub pool: *mut dpiPool,
    pub tag: *const ::std::os::raw::c_char,
    pub tagLength: u32,
    pub matchAnyTag: ::std::os::raw::c_int,
    pub outTag: *const ::std::os::raw::c_char,
    pub outTagLength: u32,
    pub outTagFound: ::std::os::raw::c_int,
    pub shardingKeyColumns: *mut dpiShardingKeyColumn,
    pub numShardingKeyColumns: u8,
    pub superShardingKeyColumns: *mut dpiShardingKeyColumn,
    pub numSuperShardingKeyColumns: u8,
    pub outNewSession: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_dpiConnCreateParams() {
    const UNINIT: ::std::mem::MaybeUninit<dpiConnCreateParams> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiConnCreateParams>(),
        136usize,
        concat!("Size of: ", stringify!(dpiConnCreateParams))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiConnCreateParams>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiConnCreateParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).authMode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(authMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connectionClass) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(connectionClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).connectionClassLength) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(connectionClassLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).purity) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(purity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).newPassword) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(newPassword)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).newPasswordLength) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(newPasswordLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).appContext) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(appContext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numAppContext) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(numAppContext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).externalAuth) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(externalAuth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).externalHandle) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(externalHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tagLength) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(tagLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).matchAnyTag) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(matchAnyTag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outTag) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(outTag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outTagLength) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(outTagLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outTagFound) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(outTagFound)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shardingKeyColumns) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(shardingKeyColumns)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numShardingKeyColumns) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(numShardingKeyColumns)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).superShardingKeyColumns) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(superShardingKeyColumns)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numSuperShardingKeyColumns) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(numSuperShardingKeyColumns)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outNewSession) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiConnCreateParams),
            "::",
            stringify!(outNewSession)
        )
    );
}
impl Default for dpiConnCreateParams {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiContextCreateParams {
    pub defaultDriverName: *const ::std::os::raw::c_char,
    pub defaultEncoding: *const ::std::os::raw::c_char,
    pub loadErrorUrl: *const ::std::os::raw::c_char,
    pub oracleClientLibDir: *const ::std::os::raw::c_char,
    pub oracleClientConfigDir: *const ::std::os::raw::c_char,
    pub sodaUseJsonDesc: ::std::os::raw::c_int,
    pub useJsonId: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_dpiContextCreateParams() {
    const UNINIT: ::std::mem::MaybeUninit<dpiContextCreateParams> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiContextCreateParams>(),
        48usize,
        concat!("Size of: ", stringify!(dpiContextCreateParams))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiContextCreateParams>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiContextCreateParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).defaultDriverName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiContextCreateParams),
            "::",
            stringify!(defaultDriverName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).defaultEncoding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiContextCreateParams),
            "::",
            stringify!(defaultEncoding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loadErrorUrl) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiContextCreateParams),
            "::",
            stringify!(loadErrorUrl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oracleClientLibDir) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiContextCreateParams),
            "::",
            stringify!(oracleClientLibDir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oracleClientConfigDir) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiContextCreateParams),
            "::",
            stringify!(oracleClientConfigDir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sodaUseJsonDesc) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiContextCreateParams),
            "::",
            stringify!(sodaUseJsonDesc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).useJsonId) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiContextCreateParams),
            "::",
            stringify!(useJsonId)
        )
    );
}
impl Default for dpiContextCreateParams {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dpiData {
    pub isNull: ::std::os::raw::c_int,
    pub value: dpiDataBuffer,
}
#[test]
fn bindgen_test_layout_dpiData() {
    const UNINIT: ::std::mem::MaybeUninit<dpiData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiData>(),
        48usize,
        concat!("Size of: ", stringify!(dpiData))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiData>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isNull) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiData),
            "::",
            stringify!(isNull)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiData),
            "::",
            stringify!(value)
        )
    );
}
impl Default for dpiData {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiDataTypeInfo {
    pub oracleTypeNum: dpiOracleTypeNum,
    pub defaultNativeTypeNum: dpiNativeTypeNum,
    pub ociTypeCode: u16,
    pub dbSizeInBytes: u32,
    pub clientSizeInBytes: u32,
    pub sizeInChars: u32,
    pub precision: i16,
    pub scale: i8,
    pub fsPrecision: u8,
    pub objectType: *mut dpiObjectType,
    pub isJson: ::std::os::raw::c_int,
    pub domainSchema: *const ::std::os::raw::c_char,
    pub domainSchemaLength: u32,
    pub domainName: *const ::std::os::raw::c_char,
    pub domainNameLength: u32,
    pub numAnnotations: u32,
    pub annotations: *mut dpiAnnotation,
    pub isOson: ::std::os::raw::c_int,
    pub vectorDimensions: u32,
    pub vectorFormat: u8,
    pub vectorFlags: u8,
}
#[test]
fn bindgen_test_layout_dpiDataTypeInfo() {
    const UNINIT: ::std::mem::MaybeUninit<dpiDataTypeInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiDataTypeInfo>(),
        104usize,
        concat!("Size of: ", stringify!(dpiDataTypeInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiDataTypeInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiDataTypeInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oracleTypeNum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(oracleTypeNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).defaultNativeTypeNum) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(defaultNativeTypeNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ociTypeCode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(ociTypeCode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbSizeInBytes) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(dbSizeInBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientSizeInBytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(clientSizeInBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sizeInChars) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(sizeInChars)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).precision) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(precision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fsPrecision) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(fsPrecision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objectType) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(objectType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isJson) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(isJson)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domainSchema) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(domainSchema)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domainSchemaLength) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(domainSchemaLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domainName) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(domainName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domainNameLength) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(domainNameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numAnnotations) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(numAnnotations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).annotations) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(annotations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isOson) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(isOson)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vectorDimensions) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(vectorDimensions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vectorFormat) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(vectorFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vectorFlags) as usize - ptr as usize },
        97usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiDataTypeInfo),
            "::",
            stringify!(vectorFlags)
        )
    );
}
impl Default for dpiDataTypeInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiAccessToken {
    pub token: *const ::std::os::raw::c_char,
    pub tokenLength: u32,
    pub privateKey: *const ::std::os::raw::c_char,
    pub privateKeyLength: u32,
}
#[test]
fn bindgen_test_layout_dpiAccessToken() {
    const UNINIT: ::std::mem::MaybeUninit<dpiAccessToken> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiAccessToken>(),
        32usize,
        concat!("Size of: ", stringify!(dpiAccessToken))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiAccessToken>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiAccessToken))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAccessToken),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokenLength) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAccessToken),
            "::",
            stringify!(tokenLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).privateKey) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAccessToken),
            "::",
            stringify!(privateKey)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).privateKeyLength) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiAccessToken),
            "::",
            stringify!(privateKeyLength)
        )
    );
}
impl Default for dpiAccessToken {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiEncodingInfo {
    pub encoding: *const ::std::os::raw::c_char,
    pub maxBytesPerCharacter: i32,
    pub nencoding: *const ::std::os::raw::c_char,
    pub nmaxBytesPerCharacter: i32,
}
#[test]
fn bindgen_test_layout_dpiEncodingInfo() {
    const UNINIT: ::std::mem::MaybeUninit<dpiEncodingInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiEncodingInfo>(),
        32usize,
        concat!("Size of: ", stringify!(dpiEncodingInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiEncodingInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiEncodingInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoding) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiEncodingInfo),
            "::",
            stringify!(encoding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxBytesPerCharacter) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiEncodingInfo),
            "::",
            stringify!(maxBytesPerCharacter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nencoding) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiEncodingInfo),
            "::",
            stringify!(nencoding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nmaxBytesPerCharacter) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiEncodingInfo),
            "::",
            stringify!(nmaxBytesPerCharacter)
        )
    );
}
impl Default for dpiEncodingInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiErrorInfo {
    pub code: i32,
    pub offset16: u16,
    pub message: *const ::std::os::raw::c_char,
    pub messageLength: u32,
    pub encoding: *const ::std::os::raw::c_char,
    pub fnName: *const ::std::os::raw::c_char,
    pub action: *const ::std::os::raw::c_char,
    pub sqlState: *const ::std::os::raw::c_char,
    pub isRecoverable: ::std::os::raw::c_int,
    pub isWarning: ::std::os::raw::c_int,
    pub offset: u32,
}
#[test]
fn bindgen_test_layout_dpiErrorInfo() {
    const UNINIT: ::std::mem::MaybeUninit<dpiErrorInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiErrorInfo>(),
        72usize,
        concat!("Size of: ", stringify!(dpiErrorInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiErrorInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiErrorInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).code) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset16) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(offset16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).messageLength) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(messageLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encoding) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(encoding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fnName) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(fnName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sqlState) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(sqlState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isRecoverable) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(isRecoverable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isWarning) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(isWarning)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiErrorInfo),
            "::",
            stringify!(offset)
        )
    );
}
impl Default for dpiErrorInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiObjectAttrInfo {
    pub name: *const ::std::os::raw::c_char,
    pub nameLength: u32,
    pub typeInfo: dpiDataTypeInfo,
}
#[test]
fn bindgen_test_layout_dpiObjectAttrInfo() {
    const UNINIT: ::std::mem::MaybeUninit<dpiObjectAttrInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiObjectAttrInfo>(),
        120usize,
        concat!("Size of: ", stringify!(dpiObjectAttrInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiObjectAttrInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiObjectAttrInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectAttrInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameLength) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectAttrInfo),
            "::",
            stringify!(nameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeInfo) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectAttrInfo),
            "::",
            stringify!(typeInfo)
        )
    );
}
impl Default for dpiObjectAttrInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiObjectTypeInfo {
    pub schema: *const ::std::os::raw::c_char,
    pub schemaLength: u32,
    pub name: *const ::std::os::raw::c_char,
    pub nameLength: u32,
    pub isCollection: ::std::os::raw::c_int,
    pub elementTypeInfo: dpiDataTypeInfo,
    pub numAttributes: u16,
    pub packageName: *const ::std::os::raw::c_char,
    pub packageNameLength: u32,
}
#[test]
fn bindgen_test_layout_dpiObjectTypeInfo() {
    const UNINIT: ::std::mem::MaybeUninit<dpiObjectTypeInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiObjectTypeInfo>(),
        160usize,
        concat!("Size of: ", stringify!(dpiObjectTypeInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiObjectTypeInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiObjectTypeInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).schema) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectTypeInfo),
            "::",
            stringify!(schema)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).schemaLength) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectTypeInfo),
            "::",
            stringify!(schemaLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectTypeInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameLength) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectTypeInfo),
            "::",
            stringify!(nameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isCollection) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectTypeInfo),
            "::",
            stringify!(isCollection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).elementTypeInfo) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectTypeInfo),
            "::",
            stringify!(elementTypeInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numAttributes) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectTypeInfo),
            "::",
            stringify!(numAttributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).packageName) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectTypeInfo),
            "::",
            stringify!(packageName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).packageNameLength) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiObjectTypeInfo),
            "::",
            stringify!(packageNameLength)
        )
    );
}
impl Default for dpiObjectTypeInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiPoolCreateParams {
    pub minSessions: u32,
    pub maxSessions: u32,
    pub sessionIncrement: u32,
    pub pingInterval: ::std::os::raw::c_int,
    pub pingTimeout: ::std::os::raw::c_int,
    pub homogeneous: ::std::os::raw::c_int,
    pub externalAuth: ::std::os::raw::c_int,
    pub getMode: dpiPoolGetMode,
    pub outPoolName: *const ::std::os::raw::c_char,
    pub outPoolNameLength: u32,
    pub timeout: u32,
    pub waitTimeout: u32,
    pub maxLifetimeSession: u32,
    pub plsqlFixupCallback: *const ::std::os::raw::c_char,
    pub plsqlFixupCallbackLength: u32,
    pub maxSessionsPerShard: u32,
    pub accessTokenCallback: dpiAccessTokenCallback,
    pub accessTokenCallbackContext: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_dpiPoolCreateParams() {
    const UNINIT: ::std::mem::MaybeUninit<dpiPoolCreateParams> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiPoolCreateParams>(),
        88usize,
        concat!("Size of: ", stringify!(dpiPoolCreateParams))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiPoolCreateParams>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiPoolCreateParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minSessions) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(minSessions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxSessions) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(maxSessions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sessionIncrement) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(sessionIncrement)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pingInterval) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(pingInterval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pingTimeout) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(pingTimeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).homogeneous) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(homogeneous)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).externalAuth) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(externalAuth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getMode) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(getMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outPoolName) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(outPoolName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outPoolNameLength) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(outPoolNameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).waitTimeout) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(waitTimeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxLifetimeSession) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(maxLifetimeSession)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plsqlFixupCallback) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(plsqlFixupCallback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).plsqlFixupCallbackLength) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(plsqlFixupCallbackLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxSessionsPerShard) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(maxSessionsPerShard)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessTokenCallback) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(accessTokenCallback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accessTokenCallbackContext) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiPoolCreateParams),
            "::",
            stringify!(accessTokenCallbackContext)
        )
    );
}
impl Default for dpiPoolCreateParams {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiQueryInfo {
    pub name: *const ::std::os::raw::c_char,
    pub nameLength: u32,
    pub typeInfo: dpiDataTypeInfo,
    pub nullOk: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_dpiQueryInfo() {
    const UNINIT: ::std::mem::MaybeUninit<dpiQueryInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiQueryInfo>(),
        128usize,
        concat!("Size of: ", stringify!(dpiQueryInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiQueryInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiQueryInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiQueryInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameLength) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiQueryInfo),
            "::",
            stringify!(nameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeInfo) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiQueryInfo),
            "::",
            stringify!(typeInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nullOk) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiQueryInfo),
            "::",
            stringify!(nullOk)
        )
    );
}
impl Default for dpiQueryInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiMsgRecipient {
    pub name: *const ::std::os::raw::c_char,
    pub nameLength: u32,
}
#[test]
fn bindgen_test_layout_dpiMsgRecipient() {
    const UNINIT: ::std::mem::MaybeUninit<dpiMsgRecipient> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiMsgRecipient>(),
        16usize,
        concat!("Size of: ", stringify!(dpiMsgRecipient))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiMsgRecipient>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiMsgRecipient))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiMsgRecipient),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameLength) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiMsgRecipient),
            "::",
            stringify!(nameLength)
        )
    );
}
impl Default for dpiMsgRecipient {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dpiShardingKeyColumn {
    pub oracleTypeNum: dpiOracleTypeNum,
    pub nativeTypeNum: dpiNativeTypeNum,
    pub value: dpiDataBuffer,
}
#[test]
fn bindgen_test_layout_dpiShardingKeyColumn() {
    const UNINIT: ::std::mem::MaybeUninit<dpiShardingKeyColumn> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiShardingKeyColumn>(),
        48usize,
        concat!("Size of: ", stringify!(dpiShardingKeyColumn))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiShardingKeyColumn>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiShardingKeyColumn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oracleTypeNum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiShardingKeyColumn),
            "::",
            stringify!(oracleTypeNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nativeTypeNum) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiShardingKeyColumn),
            "::",
            stringify!(nativeTypeNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiShardingKeyColumn),
            "::",
            stringify!(value)
        )
    );
}
impl Default for dpiShardingKeyColumn {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dpiStringList {
    pub __bindgen_anon_1: dpiStringList__bindgen_ty_1,
    pub __bindgen_anon_2: dpiStringList__bindgen_ty_2,
    pub __bindgen_anon_3: dpiStringList__bindgen_ty_3,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dpiStringList__bindgen_ty_1 {
    pub numStrings: u32,
    pub numNames: u32,
}
#[test]
fn bindgen_test_layout_dpiStringList__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<dpiStringList__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiStringList__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(dpiStringList__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiStringList__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(dpiStringList__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numStrings) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStringList__bindgen_ty_1),
            "::",
            stringify!(numStrings)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numNames) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStringList__bindgen_ty_1),
            "::",
            stringify!(numNames)
        )
    );
}
impl Default for dpiStringList__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dpiStringList__bindgen_ty_2 {
    pub strings: *mut *const ::std::os::raw::c_char,
    pub names: *mut *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_dpiStringList__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<dpiStringList__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiStringList__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(dpiStringList__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiStringList__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiStringList__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).strings) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStringList__bindgen_ty_2),
            "::",
            stringify!(strings)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).names) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStringList__bindgen_ty_2),
            "::",
            stringify!(names)
        )
    );
}
impl Default for dpiStringList__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dpiStringList__bindgen_ty_3 {
    pub stringLengths: *mut u32,
    pub nameLengths: *mut u32,
}
#[test]
fn bindgen_test_layout_dpiStringList__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<dpiStringList__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiStringList__bindgen_ty_3>(),
        8usize,
        concat!("Size of: ", stringify!(dpiStringList__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiStringList__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiStringList__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stringLengths) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStringList__bindgen_ty_3),
            "::",
            stringify!(stringLengths)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameLengths) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStringList__bindgen_ty_3),
            "::",
            stringify!(nameLengths)
        )
    );
}
impl Default for dpiStringList__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_dpiStringList() {
    assert_eq!(
        ::std::mem::size_of::<dpiStringList>(),
        24usize,
        concat!("Size of: ", stringify!(dpiStringList))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiStringList>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiStringList))
    );
}
impl Default for dpiStringList {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSodaOperOptions {
    pub numKeys: u32,
    pub keys: *mut *const ::std::os::raw::c_char,
    pub keyLengths: *mut u32,
    pub key: *const ::std::os::raw::c_char,
    pub keyLength: u32,
    pub version: *const ::std::os::raw::c_char,
    pub versionLength: u32,
    pub filter: *const ::std::os::raw::c_char,
    pub filterLength: u32,
    pub skip: u32,
    pub limit: u32,
    pub fetchArraySize: u32,
    pub hint: *const ::std::os::raw::c_char,
    pub hintLength: u32,
    pub lock: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_dpiSodaOperOptions() {
    const UNINIT: ::std::mem::MaybeUninit<dpiSodaOperOptions> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiSodaOperOptions>(),
        96usize,
        concat!("Size of: ", stringify!(dpiSodaOperOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiSodaOperOptions>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiSodaOperOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numKeys) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(numKeys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keys) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(keys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keyLengths) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(keyLengths)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keyLength) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(keyLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).versionLength) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(versionLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filter) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).filterLength) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(filterLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skip) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(skip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).limit) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(limit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fetchArraySize) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(fetchArraySize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(hint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hintLength) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(hintLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSodaOperOptions),
            "::",
            stringify!(lock)
        )
    );
}
impl Default for dpiSodaOperOptions {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dpiStmtInfo {
    pub isQuery: ::std::os::raw::c_int,
    pub isPLSQL: ::std::os::raw::c_int,
    pub isDDL: ::std::os::raw::c_int,
    pub isDML: ::std::os::raw::c_int,
    pub statementType: dpiStatementType,
    pub isReturning: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_dpiStmtInfo() {
    const UNINIT: ::std::mem::MaybeUninit<dpiStmtInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiStmtInfo>(),
        24usize,
        concat!("Size of: ", stringify!(dpiStmtInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiStmtInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(dpiStmtInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isQuery) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStmtInfo),
            "::",
            stringify!(isQuery)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isPLSQL) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStmtInfo),
            "::",
            stringify!(isPLSQL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isDDL) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStmtInfo),
            "::",
            stringify!(isDDL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isDML) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStmtInfo),
            "::",
            stringify!(isDML)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).statementType) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStmtInfo),
            "::",
            stringify!(statementType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isReturning) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiStmtInfo),
            "::",
            stringify!(isReturning)
        )
    );
}
pub type dpiSubscrCallback = ::std::option::Option<
    unsafe extern "C" fn(context: *mut ::std::os::raw::c_void, message: *mut dpiSubscrMessage),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSubscrCreateParams {
    pub subscrNamespace: dpiSubscrNamespace,
    pub protocol: dpiSubscrProtocol,
    pub qos: dpiSubscrQOS,
    pub operations: dpiOpCode,
    pub portNumber: u32,
    pub timeout: u32,
    pub name: *const ::std::os::raw::c_char,
    pub nameLength: u32,
    pub callback: dpiSubscrCallback,
    pub callbackContext: *mut ::std::os::raw::c_void,
    pub recipientName: *const ::std::os::raw::c_char,
    pub recipientNameLength: u32,
    pub ipAddress: *const ::std::os::raw::c_char,
    pub ipAddressLength: u32,
    pub groupingClass: u8,
    pub groupingValue: u32,
    pub groupingType: u8,
    pub outRegId: u64,
    pub clientInitiated: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_dpiSubscrCreateParams() {
    const UNINIT: ::std::mem::MaybeUninit<dpiSubscrCreateParams> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiSubscrCreateParams>(),
        112usize,
        concat!("Size of: ", stringify!(dpiSubscrCreateParams))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiSubscrCreateParams>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiSubscrCreateParams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subscrNamespace) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(subscrNamespace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).protocol) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(protocol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qos) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(qos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operations) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(operations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).portNumber) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(portNumber)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameLength) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(nameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callback) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).callbackContext) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(callbackContext)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recipientName) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(recipientName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recipientNameLength) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(recipientNameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipAddress) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(ipAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipAddressLength) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(ipAddressLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).groupingClass) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(groupingClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).groupingValue) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(groupingValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).groupingType) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(groupingType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outRegId) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(outRegId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientInitiated) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrCreateParams),
            "::",
            stringify!(clientInitiated)
        )
    );
}
impl Default for dpiSubscrCreateParams {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSubscrMessage {
    pub eventType: dpiEventType,
    pub dbName: *const ::std::os::raw::c_char,
    pub dbNameLength: u32,
    pub tables: *mut dpiSubscrMessageTable,
    pub numTables: u32,
    pub queries: *mut dpiSubscrMessageQuery,
    pub numQueries: u32,
    pub errorInfo: *mut dpiErrorInfo,
    pub txId: *const ::std::os::raw::c_void,
    pub txIdLength: u32,
    pub registered: ::std::os::raw::c_int,
    pub queueName: *const ::std::os::raw::c_char,
    pub queueNameLength: u32,
    pub consumerName: *const ::std::os::raw::c_char,
    pub consumerNameLength: u32,
    pub aqMsgId: *const ::std::os::raw::c_void,
    pub aqMsgIdLength: u32,
}
#[test]
fn bindgen_test_layout_dpiSubscrMessage() {
    const UNINIT: ::std::mem::MaybeUninit<dpiSubscrMessage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiSubscrMessage>(),
        128usize,
        concat!("Size of: ", stringify!(dpiSubscrMessage))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiSubscrMessage>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiSubscrMessage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eventType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(eventType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(dbName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dbNameLength) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(dbNameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tables) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(tables)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numTables) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(numTables)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).queries) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(queries)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numQueries) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(numQueries)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).errorInfo) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(errorInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).txId) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(txId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).txIdLength) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(txIdLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).registered) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(registered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).queueName) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(queueName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).queueNameLength) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(queueNameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).consumerName) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(consumerName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).consumerNameLength) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(consumerNameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aqMsgId) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(aqMsgId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aqMsgIdLength) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessage),
            "::",
            stringify!(aqMsgIdLength)
        )
    );
}
impl Default for dpiSubscrMessage {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSubscrMessageQuery {
    pub id: u64,
    pub operation: dpiOpCode,
    pub tables: *mut dpiSubscrMessageTable,
    pub numTables: u32,
}
#[test]
fn bindgen_test_layout_dpiSubscrMessageQuery() {
    const UNINIT: ::std::mem::MaybeUninit<dpiSubscrMessageQuery> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiSubscrMessageQuery>(),
        32usize,
        concat!("Size of: ", stringify!(dpiSubscrMessageQuery))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiSubscrMessageQuery>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiSubscrMessageQuery))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageQuery),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operation) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageQuery),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tables) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageQuery),
            "::",
            stringify!(tables)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numTables) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageQuery),
            "::",
            stringify!(numTables)
        )
    );
}
impl Default for dpiSubscrMessageQuery {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSubscrMessageRow {
    pub operation: dpiOpCode,
    pub rowid: *const ::std::os::raw::c_char,
    pub rowidLength: u32,
}
#[test]
fn bindgen_test_layout_dpiSubscrMessageRow() {
    const UNINIT: ::std::mem::MaybeUninit<dpiSubscrMessageRow> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiSubscrMessageRow>(),
        24usize,
        concat!("Size of: ", stringify!(dpiSubscrMessageRow))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiSubscrMessageRow>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiSubscrMessageRow))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageRow),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rowid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageRow),
            "::",
            stringify!(rowid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rowidLength) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageRow),
            "::",
            stringify!(rowidLength)
        )
    );
}
impl Default for dpiSubscrMessageRow {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiSubscrMessageTable {
    pub operation: dpiOpCode,
    pub name: *const ::std::os::raw::c_char,
    pub nameLength: u32,
    pub rows: *mut dpiSubscrMessageRow,
    pub numRows: u32,
}
#[test]
fn bindgen_test_layout_dpiSubscrMessageTable() {
    const UNINIT: ::std::mem::MaybeUninit<dpiSubscrMessageTable> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiSubscrMessageTable>(),
        40usize,
        concat!("Size of: ", stringify!(dpiSubscrMessageTable))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiSubscrMessageTable>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiSubscrMessageTable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageTable),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageTable),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameLength) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageTable),
            "::",
            stringify!(nameLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rows) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageTable),
            "::",
            stringify!(rows)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numRows) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiSubscrMessageTable),
            "::",
            stringify!(numRows)
        )
    );
}
impl Default for dpiSubscrMessageTable {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct dpiVersionInfo {
    pub versionNum: ::std::os::raw::c_int,
    pub releaseNum: ::std::os::raw::c_int,
    pub updateNum: ::std::os::raw::c_int,
    pub portReleaseNum: ::std::os::raw::c_int,
    pub portUpdateNum: ::std::os::raw::c_int,
    pub fullVersionNum: u32,
}
#[test]
fn bindgen_test_layout_dpiVersionInfo() {
    const UNINIT: ::std::mem::MaybeUninit<dpiVersionInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiVersionInfo>(),
        24usize,
        concat!("Size of: ", stringify!(dpiVersionInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiVersionInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(dpiVersionInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).versionNum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVersionInfo),
            "::",
            stringify!(versionNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).releaseNum) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVersionInfo),
            "::",
            stringify!(releaseNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).updateNum) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVersionInfo),
            "::",
            stringify!(updateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).portReleaseNum) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVersionInfo),
            "::",
            stringify!(portReleaseNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).portUpdateNum) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVersionInfo),
            "::",
            stringify!(portUpdateNum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fullVersionNum) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVersionInfo),
            "::",
            stringify!(fullVersionNum)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dpiVectorDimensionBuffer {
    pub asPtr: *mut ::std::os::raw::c_void,
    pub asInt8: *mut i8,
    pub asFloat: *mut f32,
    pub asDouble: *mut f64,
}
#[test]
fn bindgen_test_layout_dpiVectorDimensionBuffer() {
    const UNINIT: ::std::mem::MaybeUninit<dpiVectorDimensionBuffer> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiVectorDimensionBuffer>(),
        8usize,
        concat!("Size of: ", stringify!(dpiVectorDimensionBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiVectorDimensionBuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiVectorDimensionBuffer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asPtr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVectorDimensionBuffer),
            "::",
            stringify!(asPtr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asInt8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVectorDimensionBuffer),
            "::",
            stringify!(asInt8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asFloat) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVectorDimensionBuffer),
            "::",
            stringify!(asFloat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asDouble) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVectorDimensionBuffer),
            "::",
            stringify!(asDouble)
        )
    );
}
impl Default for dpiVectorDimensionBuffer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dpiVectorInfo {
    pub format: u8,
    pub numDimensions: u32,
    pub dimensionSize: u8,
    pub dimensions: dpiVectorDimensionBuffer,
}
#[test]
fn bindgen_test_layout_dpiVectorInfo() {
    const UNINIT: ::std::mem::MaybeUninit<dpiVectorInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiVectorInfo>(),
        24usize,
        concat!("Size of: ", stringify!(dpiVectorInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiVectorInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiVectorInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVectorInfo),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numDimensions) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVectorInfo),
            "::",
            stringify!(numDimensions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dimensionSize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVectorInfo),
            "::",
            stringify!(dimensionSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dimensions) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiVectorInfo),
            "::",
            stringify!(dimensions)
        )
    );
}
impl Default for dpiVectorInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dpiXid {
    pub formatId: ::std::os::raw::c_long,
    pub globalTransactionId: *const ::std::os::raw::c_char,
    pub globalTransactionIdLength: u32,
    pub branchQualifier: *const ::std::os::raw::c_char,
    pub branchQualifierLength: u32,
}
#[test]
fn bindgen_test_layout_dpiXid() {
    const UNINIT: ::std::mem::MaybeUninit<dpiXid> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<dpiXid>(),
        40usize,
        concat!("Size of: ", stringify!(dpiXid))
    );
    assert_eq!(
        ::std::mem::align_of::<dpiXid>(),
        8usize,
        concat!("Alignment of ", stringify!(dpiXid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formatId) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiXid),
            "::",
            stringify!(formatId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).globalTransactionId) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiXid),
            "::",
            stringify!(globalTransactionId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).globalTransactionIdLength) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiXid),
            "::",
            stringify!(globalTransactionIdLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).branchQualifier) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiXid),
            "::",
            stringify!(branchQualifier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).branchQualifierLength) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dpiXid),
            "::",
            stringify!(branchQualifierLength)
        )
    );
}
impl Default for dpiXid {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn dpiContext_createWithParams(
        majorVersion: ::std::os::raw::c_uint,
        minorVersion: ::std::os::raw::c_uint,
        params: *mut dpiContextCreateParams,
        context: *mut *mut dpiContext,
        errorInfo: *mut dpiErrorInfo,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dpiContext_destroy(context: *mut dpiContext) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dpiContext_freeStringList(
        context: *mut dpiContext,
        list: *mut dpiStringList,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dpiContext_getClientVersion(
